/**
 * 常用方法、变量
 */
var showTips;

/**
 * 常用方法 Start
 */
// ExtJS showTips方法
showTips = function(value, meta, rec, rowIdx, colIdx, ds) {
	return '<div ext:qtitle="" ext:qtip="' + value + '">' + value + '</div>';
};
//对象类型
_ObjectType = [["FY","法院"],["TS","庭室"],["RY","人员"]];

_sydx = [["FY2","高院"],["FY3","中院"],["FY4","基层"],["DQ3","全省各地市"],["QS2","全省各法院"],["BM2","高院部门"],["BM3","中院部门"],["BM4","基层部门"]];

//法院范围
_FyJb =  [['','全部'],['2','省院'],['3','中级法院'],['4','基层法院']];
//是否
_YesOrNo = [["1","是"],["0","否"]];
//开启 关闭
_OpenState = [["1","开启"],["0","关闭"]];
//月份
_Months = [["01","1月"],["02","2月"],["03","3月"],["04","4月"],["05","5月"],["06","6月"],
           ["07","7月"],["08","8月"],["09","9月"],["10","10月"],["11","11月"],["12","12月"]];
//评估模式
_PGMS = [["0","动态评估模式"],["1","静态评估模式"],["2","混合评估模式"]];
_PGMS_NEW = [["0","动态评估模式"],["1","静态评估模式"],["2","混合评估模式"],["3","参考分值评估模式"]];
//正、逆
_FX = [["+","正指标"],["-","逆指标"]];
//聚合方式
_AGGTYPE=[['SUM',"合计"],['AVG',"平均"],['FIRST',"取开始点"],['LAST',"取结束点"]];
//数据类型
_DATATYPE=[['N',"数量"],['M',"金钱"]];
//公式执行类型
_FORMULATYPE=[['SCRIPT',"脚本"],['CLAZZ',"扩展类"]];
//公式执行类型
_ANALYSISTYPE=[['datadb',"质效数据库"],['realdb',"数据采集库"]];
//均值对比
_AVGCMP=[['NO',"不显示指标平均值"],['QS',"全省所有法院平均值"],['ZY',"全省中级法院平均值"],['JC',"全省基层法院平均值"]];
//采集方式
_AUTOTYPE=[['1',"自动采集"],['0',"手工补录"]];
